06_DTCHull_interFoam/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             c0; // name of topoSet/cellSet (see topoSetDict)

coordinateSystem global;

// Specifies refinement directions by a name and a vector. The normal direction is calculated as tan1^tan2
globalCoeffs
{
    tan1            (1 0 0); // x-direction, name and direction vector
    tan2            (0 1 0); // y-direction
}

patchLocalCoeffs
{
    patch           outside; // Normal direction is face normal of zero'th face of patch
    tan1            (1 0 0);
}

// Specifies the direction to be refined by the name used above
// To refine in the third direction, use the keyword 'normal'
directions      ( tan1 tan2 ); // x,y-dir only, z-direction is already refined in blockMesh

// Whether to use hex topology. This will
// - if patchLocal: all cells on selected patch should be hex
// - split all hexes in 2x2x2 through the middle of edges.
useHexTopology  no;     

// Cut purely geometric (will cut hexes through vertices) or take
// topology into account. Incompatible with 'useHexTopology'
geometricCut    yes;
// Use either "useHexTopology" or "geometricCut", both shouldn't be "yes"

writeMesh       no; // Write meshes from intermediate steps


// ************************************************************************* //
